Revit 2027 API
ViewFamilyType.IsValidDefaultTemplate Method
 Verifies that the input can be used as a default template for this view type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsValidDefaultTemplate(
	ElementId templateId
)
Public Function IsValidDefaultTemplate (
	templateId As ElementId
) As Boolean
public:
bool IsValidDefaultTemplate(
	ElementId^ templateId
)
member IsValidDefaultTemplate :
        templateId : ElementId -> bool
Parameters
templateId ElementId
 Id to be validated as default template.
Return Value
Boolean
 True if %templateId% is valid as default template, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 The id must represent a template view that is compatible with this view type, or InvalidElementId.
See Also
Reference
ViewFamilyType Class
Autodesk.Revit.DB Namespace